tsung_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
   <!-- <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="30" unit="second">
     <users arrivalrate="512" unit="second"></users>
   </arrivalphase>-->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <!-- Tutor -->
    <session name="tutor-session" probability="50" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/signup' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_string" length="13">
        <var name="rndstring1" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="200">
        <var name="course_number" />
      </setdynvars>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Sign up a new user -->
      <request subst="true">
        <http url='/signup' version='1.1' method='POST'
          contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Edit Profile -->
      <request>
        <http url='/edit_profile' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Add Education-->
      <request subst="true">
        <http url='/add_education' version='1.1' method='POST'
          contents="education%5Bname%5D=university+of+california+los+angeles&amp;education%5Balias%5D=ucla&amp;commit=Add+education"></http>
      </request>

      <request>
        <http url='/edit_profile' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/edit_education?eid=1' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Add course to education -->
      <request subst="true">
        <http url='/update_education' version='1.1' method='POST'
          contents="course_user%5Bcourse_name%5D=computer+science+%%_course_number%%&amp;course_user%5Bcourse_alias%5D=cs%%_course_number%%&amp;course%5Bdepartment%5D=computer+science&amp;commit=Add+Course"></http>
      </request>

      <repeat name="checkRequests" max_repeat="10">
        <thinktime value="5" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="request_params" re='&lt;form class="button-to-form" method="post" action="(.*)"&gt;' ></dyn_variable>
          <http url='/requests' version='1.1' method='GET'></http>
        </request>
        <until var="request_params" neq='' />
      </repeat>

      <if var="request_params" neq=''>
        <request subst="true">
          <http url='/accept_request?%%_request_params%%' version='1.1' method='POST'></http>
        </request>
      </if>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
          io:format([126, $p, 126, $n, 126, $n], [DynVars]),
          ok end.">
          <var name="dump" />
      </setdynvars>

    </session>


    <session name="student-session" probability="50" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/signup' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_string" length="13">
        <var name="rndstring1" />
      </setdynvars>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Sign up a new user -->
      <request subst="true">
        <http url='/signup' version='1.1' method='POST'
          contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"></http>
      </request>

      <request subst="true">
          <dyn_variable name="my_id" re='href="/users/([0-9]*)"&gt;Profile' ></dyn_variable>
          <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 5 seconds -->
      <thinktime value="5" random="true"></thinktime>

      <!-- Search for a tutor by course type-->
      <repeat name="find_courses" max_repeat="10">
        <setdynvars sourcetype="random_number" start="1" end="200">
          <var name="course_number" />
        </setdynvars>

        <request subst="true">
          <dyn_variable name="course_url" re='&lt;li&gt;\s*&lt;a href="(.*)">computer science' ></dyn_variable>
          <http url='/search?type=Course&amp;input=cs%%_course_number%%' version='1.1' method='GET'></http>
        </request>
        <until var="course_url" neq='' />
      </repeat>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true">
        <dyn_variable name="user_id" re='&lt;a href="/users/([0-9]*)"&gt;' ></dyn_variable>
        <http url='%%_course_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true">
        <http url='/users/%%_user_id%%' version='1.1' method='GET'></http>
      </request>

      <request subst="true">
        <http url='/request_tutor?user=%%_user_id%%' version='1.1' method='POST'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rndmsg" />
      </setdynvars>

      <request subst="true">
        <http url='/send_user_request' version='1.1' method='POST'
          contents="message=%%_rndmsg%%&amp;tutor=%%_user_id%%&amp;student=%%_my_id%%&amp;type=tutor_request&amp;commit=Send+Request"></http>
      </request>

      <!--<thinktime value="3" random="true"></thinktime>-->

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
          io:format([126, $p, 126, $n, 126, $n], [DynVars]),
          ok end.">
          <var name="dump" />
      </setdynvars>

    </session>
  </sessions>
</tsung>